//
//  structEnumForTeaModel.swift
//  Exam21Lesson
//
//  Created by Black Bacterium on 30.12.2025.
//

import UIKit

struct TeaModel {
    let nameTea: String
    let description: String
}

enum NameTea {
    static let tea_1 = "Би Ло Чунь"
    static let tea_2 = "Бай Юй Сянь Ча"
    static let tea_3 = "Цзюньшань Инь Чжэнь"
    static let tea_4 = "Да Хун Пао"
    static let tea_5 = "Цихун"
    static let tea_6 = "Бай Мудань Ван"
    static let tea_7 = "Цзингу Байлун"
}

enum DescriptionTeas {
    static let tea_1 = "Би Ло Чунь \nИзвестнейший сорт зеленого чая из провинции Цзянсу, настой зеленого оттенка, с небольшой желтизной. Вкус округлый, маслянистый, плотный. Аромат на дне чашки теплый, цветочно-нектарный, с нотами тыквенных семечек. \nТемпература заваривания: 70-80°C"
    static let tea_2 = "Бай Юй Сянь Ча \nЗелёный чай, во многом похож на Аньцзи Бай Ча — та же хрупкость, нежность. Аромат сухого листа спокойный, бархатный, «теплый». Вкус нежный, цветочный, с оттенками смородинового листа, эстрагона и очень заметным умами. \nТемпература заваривания: 70-80°C"
    static let tea_3 = "Цзюньшань Инь Чжэнь \nЖелтый чай «Серебряные Иглы с горы Цзюнь Шань» — одно из самых сложных, красивых и загадочных явлений в мире чая. Чай-ощущение, наполненный пустотой, тонким и сложным рисунком цветочных, вяленых, кондитерских оттенков, сладких ароматов, напоминающих где-то мед, цветущий луг и сладкое сено, а где-то — козий сыр. \nТемпература заваривания: 75-85°C"
    static let tea_4 = "Да Хун Пао \nЭто улун. Представитель большой и очень разнообразной группы чаёв. Улуны — это сотни сортов, которые отличаются скруткой, степенью прогрева и ферментации, а также географией. Но среди все этого непостижимого многообразия чаще всего слышится название Да Хун Пао. Аромат свежей выпечки, пряностей и дух огня. Вкус меда, корицы, диких цветов и сдобы. \nТемпература заваривания: 90-95°C"
    static let tea_5 = "Цихун \nКрасный чай из уезда Цимэнь, провинция Аньхой. Вкус цельный, сложенный в крепкое, но гладкое ядро. С хорошей танинностью, уравновешенной естественной, не приторной сладостью. Под оттенками фруктов, ягод и выпечки отчетливо звучит огненная мелодия Цихуна. \nТемпература заваривания: 90-95°C"
    static let tea_6 = "Бай Мудань Ван \nБелый чай. Аромат сухого чая сладкий, луговой, с грибными оттенками. Вкус пряный и прозрачный. С медовыми нотами, остротой, выраженным умами.В чае красивая пустотная гармония белого чая. Стройность и строгость. Сильное воздействие на ум и тело. \nТемпература заваривания: 70-75°C"
    static let tea_7 = "Шэн пуэр Цзингу Байлун /nВкус раскрывается постепенно. В первых проливах — легкий, прозрачный, абрикосовый. Затем настой густеет, формируется цельная красивая мелодия: оттенки сухофруктов, пряностей, цветов и дорогого трубочного табака. Тело чая легкое, текстура мягкая. Послевкусие сочное и красивое. \nТемпература заваривания: 90-100°C"
}

